text_help = '''<b>1. ВЫБОР РОЛИ.</b>
Для создания поездки Вам необходимо выбрать роль – Водитель или Пассажир.

<b>2. ВЫБОР НАЧАЛЬНОЙ УЛИЦЫ.</b> 
- Необходимо либо нажать кнопку "<i>Передать свою геолокацию в качестве начальной точки</i>";
- либо ввести  название населенного пункта (<i>поддерживается как украинский так и русский языки</i>) <b>без аббревиатур</b> пгт, село, город и т.д.

<b>3. ВВОД УЛИЦЫ.</b>
Cледующим пунктом необходимо ввести название улицы (<i>поддерживается как украинский так и русский языки</i>).
С целью ускорения работы с ботом, такие слова как – улица, бульвар, переулок и т.д. можно не вводить, за исключением тех случаев, если в населённом пункте есть, к примеру улица и бульвар с идентичными наименованиями.
В случае, <b>если бот не нашел нужный Вам адрес</b>, необходимо пробовать варианты:
<i>- если ввели Тараса Шевченко 25, попробовать ввести Шевченко 25</i>
<i>- неправильный ввод метро СвятошинО, ввести метро Святошин</i>

<b>4. ПОДТВЕРДЖЕНИЕ АДРЕСА.</b>
После этого Вы увидите карту, полный адрес и варианты правильности выбора 
адреса (<i>Да или Нет</i>). В случае нажатия кнопки "Нет" - выбор начальной 
точки начнется заново.

<b>5. ВЫБОР КОНЕЧНОЙ ТОЧКИ.</b>
Выбор конечной точки маршрута происходит по аналогии с выбором начальной 
точки.

<b>6. ВЫБОР ДНЯ.</b>
Затем делаем выбор дня кнопками "Сегодня" либо "Завтра".

<b>7. ВЫБОР ВРЕМЕНИ:</b>
Далее вводим необходимое Время поездки в виде 00:00.

<b>ПРИМЕЧАНИЕ:</b>
Радиус совпадения начальных точек пассажира и водителя (ровно как и конечных точек) составляет 
1,5км (что соответствует 15 мин. ходьбы), а временной диапазон - 45 мин. В случае совпадения 
этих параметров, пассажиру будет отправлена информация о поездке водителя с указанием его 
"имени пользователя" (username) для связи с ним.

<b>❗ВНИМАНИЕ❗</b>
Если Вы являетесь водителем, необходимо чтобы у Вас в настройках Telegram было указано 
"имя пользователя" (username). Иначе пользователи-пассажиры не смогут связаться с Вами (при 
выборе username Ваш номер телефона не будет доступен другим пользователям телеграма).


Для отзывов и пожеланий - @Sergey_N_G, @Alex_S_H'''